# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 Oriented Bounding Boxes (OBB) model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/obb

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n-obb.yaml' will call yolo11-obb.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 344 layers, 2695747 parameters, 2695731 gradients, 6.9 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 344 layers, 9744931 parameters, 9744915 gradients, 22.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 434 layers, 20963523 parameters, 20963507 gradients, 72.2 GFLOPs
  l: [1.00, 1.00, 512] # summary: 656 layers, 26220995 parameters, 26220979 gradients, 91.3 GFLOPs
  x: [1.00, 1.50, 512] # summary: 656 layers, 58875331 parameters, 58875315 gradients, 204.3 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [-1, 1, Conv, [1024, 1, 1]]  # 11, Y5, lateral_convs.0
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
 
  - [6, 1, Conv, [512, 1, 1]]  # 13 input_proj.1
  - [[-2, -1], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 15, fpn_blocks.0
  - [-1, 1, Conv, [512, 1, 1]]  # 16, Y4, lateral_convs.1
 
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [4, 1, Conv, [256, 1, 1]]  # 18 input_proj.0 
  - [[-2, -1], 1, Concat, [1]]  # cat backbone P4
  - [-1, 2, C3k2, [256, False]]  # X3 (20), fpn_blocks.1
 
  - [-1, 1, Conv, [256, 3, 2]]  # 21, downsample_convs.0
  - [[-1, 16], 1, Concat, [1]]  # cat Y4
  - [-1, 2, C3k2, [512, False]]  # F4 (23), pan_blocks.0
 
  - [-1, 1, Conv, [512, 3, 2]]  # 24, downsample_convs.1
  - [[-1, 11], 1, Concat, [1]]  # cat Y5

  - [-1, 2, C3k2, [1024, True]] # F5 (26), pan_blocks.1
 
  - [[20, 23, 26], 1, OBB, [nc, 1]]  # Detect(P3, P4, P5)
